# Pandas 2

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df=pd.read_csv("data/deliveries.csv")

In [ ]:
df

In [ ]:
df.head()

# pandas functions

In [ ]:
#total run 
df["total_runs"].sum()

In [ ]:
#find average run 
df["total_runs"].mean()

In [ ]:
#most middle range run
df["total_runs"].median()

In [ ]:
#standerd daviation 
df["total_runs"].std()

In [ ]:
df["total_runs"].var()

In [ ]:
df["total_runs"].max()

In [ ]:
df["total_runs"].min()

# conditional fiitering

# 1) Total score of virat kohli

In [ ]:
df.info()

In [ ]:
df['batsman']

In [ ]:
kohli=df[df['batsman']=="V Kohli"] #feature ,variable ,column

In [ ]:
kohli.head()

In [ ]:
kohli["batsman_runs"].sum()

In [ ]:
#write a code to get batsmanwise total run 
'''
batsman   totalrun 
V Kohli     4423
sachin    
'''

In [ ]:
df['batsman'].unique()

# 2)  Wickets and dismissal types of YS Chahal

In [ ]:
chahal=df[df["bowler"]=="YS Chahal"]

In [ ]:
chahal.head()

In [ ]:
chahal['dismissal_kind'].value_counts()

In [ ]:
chahal['dismissal_kind'].unique()

# group by

In [ ]:
# group by matches on based of match_id feature 
matches=df.groupby('match_id')

In [ ]:
matches

In [ ]:
matches.groups

# 3) Top 3 runs scorers

In [ ]:
df.info()

In [ ]:
#group by batsman and calculating sum of that batsman runs
batsman_runs=df.groupby("batsman")["batsman_runs"].sum()

In [ ]:
batsman_runs.head()

In [ ]:
#sort data
sorted_runs=batsman_runs.sort_values(ascending=False)

In [ ]:
sorted_runs

In [ ]:
sorted_runs.head(3)

# 4) Highest and lowest total score in an inning

In [ ]:
match_runs=df.groupby(["match_id","inning"])["total_runs"].sum()

In [ ]:
match_runs

In [ ]:
match_runs=match_runs.reset_index()

In [ ]:
match_runs

In [ ]:
match_runs["total_runs"].max() #all records in consideration

In [ ]:
match_runs["total_runs"].min() #all records in consideration

# 5) Average score of virat kohli

In [ ]:
df

In [ ]:
kohli=df[df["batsman"]=="V Kohli"]

In [ ]:
kohli

In [ ]:
kohli_runs=kohli.groupby("match_id")["batsman_runs"].sum()

In [ ]:
kohli_runs

In [ ]:
kohli_runs.head()

In [ ]:
kohli_runs

In [ ]:
kohli_runs=kohli_runs.reset_index()

In [ ]:
kohli_runs

In [ ]:
kohli_runs['batsman_runs'].mean()

In [ ]:
kohli_runs['batsman_runs'].min()

In [ ]:
kohli_runs['batsman_runs'].max()

In [ ]:
'''
1) groupby is used to perform agrigation in data using some featurs (columns)
2)groupby gives detail data analysis of each records 
3)when we want aggrigate information like same group records mean(),median(),max(),min(),sum()
then we can use 
group is possible when we have common data into each observation 
like is match 1 is first match where how many players play suppouse 24 players 
play in one match so i can make 
1    24 for those 24 player we can make group by match id 

the same way if 100 match played and in this 100 match 20 time virat played 
then i can make those 20 aggrigate with virat name out of 100 

there should be some common facter then only group by is possible 
syntax is diff but functionality is same like SQL group by
'''

# Merge Process

In [ ]:
'''
when we have 2 or more than 2 data set and those dataset we would like to 
combine we work with merging process 

'''

In [4]:
import pandas as pd
d1 = {"name":["Kalpesh","Kiran","Nimesh","Jitesh"],"math":[77,76,89,87]}
d2 = {"name":["Kalpesh","Jitesh","Nimesh","Sushma"],"science":[79,86,82,84]}

# in above dictionary we can say something is similar and that is 
#name so if i want both dictionary name,math,science like this featuring then 
#how to do ? that is possible by performing merge process

In [5]:
df1=pd.DataFrame(d1)
df2=pd.DataFrame(d2)

In [6]:
df1

      name  math
0  Kalpesh    77
1    Kiran    76
2   Nimesh    89
3   Jitesh    87

In [7]:
df2

      name  science
0  Kalpesh       79
1   Jitesh       86
2   Nimesh       82
3   Sushma       84

In [13]:
mdata1=pd.merge(df1,df2,on="name") #inner join

In [15]:
mdata1

      name  math  science
0  Kalpesh    77       79
1   Nimesh    89       82
2   Jitesh    87       86

In [16]:
df1

      name  math
0  Kalpesh    77
1    Kiran    76
2   Nimesh    89
3   Jitesh    87

In [17]:
df2

      name  science
0  Kalpesh       79
1   Jitesh       86
2   Nimesh       82
3   Sushma       84

In [18]:
mdata1

      name  math  science
0  Kalpesh    77       79
1   Nimesh    89       82
2   Jitesh    87       86

In [20]:
#outer it work like outer join that means capable to merge data non matching data as well
mdata2=pd.merge(df1,df2,on="name",how="outer")

In [21]:
mdata2

      name  math  science
0  Kalpesh  77.0     79.0
1    Kiran  76.0      NaN
2   Nimesh  89.0     82.0
3   Jitesh  87.0     86.0
4   Sushma   NaN     84.0

In [22]:
#right outer 
mdata3=pd.merge(df1,df2,on="name",how="right")

In [23]:
mdata3

      name  math  science
0  Kalpesh  77.0       79
1   Nimesh  89.0       82
2   Jitesh  87.0       86
3   Sushma   NaN       84

In [24]:
#left outer 
mdata4=pd.merge(df1,df2,on="name",how="left")

In [25]:
mdata4

      name  math  science
0  Kalpesh    77     79.0
1    Kiran    76      NaN
2   Nimesh    89     82.0
3   Jitesh    87     86.0

# concat

In [30]:
import numpy as np
df_a = pd.DataFrame(np.arange(10).reshape(5,2),columns=["A","B"])#start from 0-10
df_b = pd.DataFrame(np.arange(10,20).reshape(5,2),columns=["X","Y"])#start from 10-20

In [28]:
df_a

   A  B
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [29]:
df_b

    X   Y
0  10  11
1  12  13
2  14  15
3  16  17
4  18  19

In [31]:
#concatination of dataframe possible row wise and column wise 
ccat=pd.concat([df_a,df_b],axis=1) #by column

In [32]:
ccat

   A  B   X   Y
0  0  1  10  11
1  2  3  12  13
2  4  5  14  15
3  6  7  16  17
4  8  9  18  19

In [33]:
rcat=pd.concat([df_a,df_b],axis=0) #by rows

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [34]:
rcat

     A    B     X     Y
0  0.0  1.0   NaN   NaN
1  2.0  3.0   NaN   NaN
2  4.0  5.0   NaN   NaN
3  6.0  7.0   NaN   NaN
4  8.0  9.0   NaN   NaN
0  NaN  NaN  10.0  11.0
1  NaN  NaN  12.0  13.0
2  NaN  NaN  14.0  15.0
3  NaN  NaN  16.0  17.0
4  NaN  NaN  18.0  19.0

# Append

In [35]:
df1

      name  math
0  Kalpesh    77
1    Kiran    76
2   Nimesh    89
3   Jitesh    87

In [47]:
df3 = {"name":["Vikram","Prasad"],"Science":[76,86]}
df3=pd.DataFrame(df3)

In [48]:
df1.append(df3)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\frame.py:7123: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort,

   Science  math     name
0      NaN  77.0  Kalpesh
1      NaN  76.0    Kiran
2      NaN  89.0   Nimesh
3      NaN  87.0   Jitesh
0     76.0   NaN   Vikram
1     86.0   NaN   Prasad

df1.append(df3,ignore_index=True)

# other pands function and all we will do into EDA process